app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
---
						<td><%= book.body %></td>
						<td><%= pluralize(book.book_comments.count, "comment") %></td>