app/views/books/index.html.erb

							<%= link_to book_favorites_path(book), method: :delete do %>
								<i class="fas fa-heart", style="color: red;"></i><%= book.favorites.count %>いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

							<%= link_to book_favorites_path(book), method: :post do %>
								<i class="fas fa-heart"></i><%= book.favorites.count %>いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

					</td>
					<td><%= pluralize(book.book_comments.count, "comment") %></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]