app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]
---
						<%= link_to book_favorites_path(@book), method: :delete do %>
							<i class="fas fa-heart", style="color: red;"></i><%= @book.favorites.count %>いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 7]]
---
						<%= link_to book_favorites_path(@book), method: :post do %>
							<i class="fas fa-heart"></i><%= @book.favorites.count %>いいね

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]
---
				</td>
				<td><%= pluralize(@book.book_comments.count, "comment") %></td>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
SELECT  1 AS one FROM "book_comments" WHERE "book_comments"."book_id" = ? LIMIT ?  [["book_id", 3], ["LIMIT", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]
---
			<div class="col-xs-12">
				<% if @book.book_comments.any? %>
				  <table class="table">
						<% @book.book_comments.each do |comment| %>