app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "朝から一発"], ["updated_at", "2020-10-02 00:41:06.007657"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if current_user != @book.user
      redirect_to books_path
    end
    if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE (title LIKE '%夜に%') ORDER BY "books"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]
---
  def search
    if params[:ub] == "1" && params[:how] == "1"
      @books = Book.searched_by_user_whole(params[:search])
    elsif params[:ub] == "1" && params[:how] == "2"
      @books = Book.searched_by_user_head_part(params[:search])
    elsif params[:ub] == "1" && params[:how] == "3"
      @books = Book.searched_by_user_tail_part(params[:search])
    elsif params[:ub] == "1" && params[:how] == "4"
      @books = Book.searched_by_user_part(params[:search])
    elsif params[:ub] == "2" && params[:how] == "1"
      @books = Book.searched_by_book_whole(params[:search])
    elsif params[:ub] == "2" && params[:how] == "2"
      @books = Book.searched_by_book_head_part(params[:search])
    elsif params[:ub] == "2" && params[:how] == "3"
      @books = Book.searched_by_book_tail_part(params[:search])
    elsif params[:ub] == "2" && params[:how] == "4"
      @books = Book.searched_by_book_part(params[:search])
    else
      @books = Book.all