app/controllers/relationships_controller.rb

  def create
    session[:previous_url] = request.referer
    user = User.find(params[:followed_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def destroy
    session[:previous_url] = request.referer
    user = Relationship.find(params[:id]).followed
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]