app/models/book.rb

	def favorited_by?(user)
		Favorite.where(user_id: user, book_id: self.id).exists?
---
SELECT  1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]