app/models/user.rb

  def unfollow(other_user)
    self.active_relationships.find_by(followed_id: other_user.id).destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 7]]